food = {'떡볶이':'가게 이름 : 선릉매운트럭떡볶이 \n광명사거리역 4번출구에서 나오면 농협은행 옆에 있는 떡볶이 맛집입니다. 매운떡볶이가 인상적인 집입니다.야끼 만두에 떡볶이 소스를 뿌려먹는 야끼무침도 일품입니다.추천하는 메뉴로는 떡볶이에 사리추가, 튀김, 야끼만두가 있습니다.',
        '두루치기':'가게 이름 : 돼지집 두루치기\n광명시 소하리 공장 옆에 있는 맛집으로 광명시의 전통 맛집 돼지집입니다 돼지집은 광명시에서 꾸준히 사랑받는 맛집중 하나입니다.두루치기 전문점 답게 메뉴가 두루치기 하나이며 돌솥밥도 나와 그맛이 일품입니다.',
       '빵':'광명시 밤일 마을에 위치한 베이커리 맛집으로 따끈한 빵을 바로 먹을수 있어서 빵맛이 정말 맛있는 베이커리입니다. 추천메뉴로는 퐁당크림치즈와 갈릭크림치즈바게트, 소금버터빵이 있습니다.',
        '카페':'가게 이름 : 에이바우트커피\n 소하동 가리대 사거리에 위치한 카페로 넓은 좌석이 있고, 프랜차이즈 커피들중에서 맛있고 가격이 싼 편입니다. 음료를 주문하면 디저트를 할인해주는 것이 특징입니다. 추천메뉴로는 아메리카노에 카라멜케잌입니다.',
        '쭈꾸미볶음':'가게 이름 : 산촌신쭈꾸미\n 소하동에 위치한 매콤달콤한 쭈꾸미볶음 맛집입니다. 가게 인테리어도 자연친화적이며 숯불향이 나는 쭈꾸미 볶음이 정말 맛있는 맛집입니다. 추천메뉴로는 쭈꾸미볶음과 도토리묵사발입니다.',
        '삼겹살':'가게 이름 : 맛찬들왕소금구이\n철산역 1번출구에서 나오면 바로 보이는 곳에 맛찬들왕소금구이 집이 있습니다. 신선한 고기들을 팔고 있으며 그 맛도 아주 환상적입니다. 이집의 특징이 명이나물을 고기에 싸먹으면 정말 맛있습니다. 추천메뉴는 14일 숙성 삼겹살입니다.',
        '쌈밥':'가게 이름 : 매화쌈밥\n 광명시 밤일 마을에 있는 쌈밥정식집입니다. 이집의 특징은 쌈밥을 시켰을 때 나오는 제육볶음과 간장새우장을 무한 리필로 먹을수 있다는 점입니다. 추천메뉴는 우렁쌈밥 정식입니다.',
        '돈까스':'가게 이름 : 홍익돈까스\n 광명시 돈까스 하면 떠오르는 이것! 바로 광명시 밤일마을에 위치한 홍익 돈까스 인데요 다른 돈까스집과 달리 커다란 왕돈까스 색다른 퓨전 양식 요리가 있어 온가족 ,연인,혼자서도 먹기 좋은 돈까스 집입니다. 추천메뉴는 홍익 왕 돈까스와 해물볶음 우동이 있습니다.',
        '초밥':'가게 이름 : 기찬스시\n 소하동 이마트에 위치한 초밥집입니다. 저렴한 초밥집들 중에서는 정말 고퀄리티의 초밥을 제공합니다. 같이 나오는 서비스 우동도 맛있습니다. 점심에 가면 한정으로 9천원으로 초밥을 먹을수 있습니다.',
        '감자탕':'가게 이름 : 철산감자탕\n 철산 상업지구에 위치한 철산 감자탕은 40년 정통의 철산을 지키고 있는 감자탕집으로 정말 감자탕이 맛있는 집입니다.',
        '소갈비':'가게 이름 : 소들녘\n 철산역 옆, 철산 상업지구에 위치한 소갈비 맛집입니다. 싼 가격은 아니지만 광명시에서 제일 맛있는 소갈비는 소들녘에서 파는 갈비라고 자부할만큼 정말 맛있는 가게입니다. 같이 나오는 반찬들도 맛있어서 꼭 여유가 있다면 들리는 것을 추천드립니다. 소갈비 외에도 식사류로 갈비탕과 한우육회비빔밥도 있으니깐 꼭 한번 먹어보세요.',
        '냉면':'가게 이름 : 강남면옥\n 광명시 밤일마을에 있는 함흥냉면 전문집 강남 면옥입니다. 냉면위에 회무침을 같이 주는 회냉면이 정말 새콤 매콤 맛있는 냉면입니다. 소갈비찜도 맛있는 집이니 한번 같이 드셔보는 것을 추천 드립니다.',
        '마라탕':'가게 이름 : 황비홍 마라탕\n 철산 상업지구 투썸플레이스 옆에 위치한 황비홍 마라탕은 광명시에서도 손꼽는 마라탕 맛집입니다. 전통적인 마라탕 맛을 고집하고 있으며 국물도 재료도 깔끔해 제일 인기 있는 핫 플레이스입니다.',
        '물회':'가게 이름 : 포항물회\n 광명 우체국 건너편에 위치한 포항물회는 광명시에서 물회로 끝내주는 집입니다. 무더운 여름날 시원한 새콤달콤한 물회 한그릇하면 몸속에 있던 더위가 사라지는 기분이 들겁니다. 물회 추천드립니다.',
        '국수':'가게 이름 : 홍두깨 칼국수\n 광명사거리 역 옆에 있는 광명시장 내에 있는 칼국수 맛집입니다. 예전부터 가게가 메스컴에 나온 맛집으로 싼값에 칼국수, 수제비, 잔치국수를 즐길수 있는 집입니다. 오랜전부터 사랑 받아온 가게입니다. 광명시장에는 다양한 음식을 파니깐 오셔서 다양한 음식을 즐겼으면 좋겠습니다.',
        '돼지김치구이':'가게 이름 : 정통짐\n 철산역 철산 상업지구에 있는 돼지김치구이 맛집입니다. 싼 가격에 맛있는 돼지 김치구이를 즐길수 있습니다. 같이 파는 돼지껍데기의 맛도 정말 맛있습니다. 돼지 김치구이를 먹고 나뒤 먹는 특미 볶음밥은 정말 맛있습니다.'}

play ={'볼링':'위드 볼링장\n 철산 상업지구에 위치한 실내 볼링장입니다.',
       '종합게임장':'아이존팝\n철산 상업지구에 위치한 멀티미디어 공간입니다. 다양한 게임과 노래방을 즐길실수 있습니다.',
       '영화관':'롯데 시네마\n광명사거리 크로앙스에 위치한 롯데시네마 입니다.',
       '가구점':'이케아\n소하동에 위치한 이케아는 우리나라에 몇없는 스웨덴 대형 가구점 입니다. 친구들과 함께 가셔서 맛있는 식사도 하면서 가구도 둘러보시면 정말 재미있습니다.',
       '아울렛':'롯데 프리미엄 아울렛\n소하동에 위치한 롯데 프리미엄 아울렛은 옆에 이케아도 있어 함께 들리면 좋은곳입니다. 다양한 식사와 다양한 옷가게, 다양한 가전제품을 팔아 한번 대형 쇼핑몰을 원하시면 들리시는것을 추천드립니다.'}

public = {'경찰서':'철산역 상업지구에 광명경찰서가 위치해있습니다.',
          '소방서':'소하동 가리대 사거리에 광명소방서가 위채해있습니다.',
          '체육관':'넓은 잔디운동장과 실내 체육시설이 겸비된 체육관 입니다. 반려견과 산책을 하고 싶으면 하안동에 위치한 광명 실내 체육관을 이용하시면 됩니다. 여름에는 작은 물놀이장도 운영된답니다.',
          '수영장':'실내 수영장을 원하신다면 철산3동 사회복지센터 건녀편에 있는 광명시 사회 체육 센터를 이용하시면 됩니다. 넓은 실내 수영장을 갖고 있습니다.'}



while True :
    print("안녕하세요 ^^ . 반갑습니다. 광명시 안내 프로 그램입니다.^^ 안내를 받고 싶다면 1을, 종료하고 싶으면 2를 눌러주세요")                                                                                                                                                                             
    number = int(input("1. 안내시작  2.종료하기\n"))
    if number ==1:
        number2=int(input("어떤 것을 알고 싶으신가요? 1. 광명시의 역사  2. 광명시의 맛집  3.  광명시의 놀거리  4. 광명시의 관공서및 공공시설  5. 광명시의 관광지."))
        if number2==1:
            print("광명시의 역사\n- 2021년 기준 약 30 만명이 살고 있는 도시로 경기도 안에 있으며, 서울시 구로구, 금천구 옆에 위치해 있는 도시다. 광명시 마스코트는 푸르름과 미래를 상징하는 광이와 광명시민의 행복을 의미하는 명이가 있다. 처음에는 시흥군에 있었다가 1981년 광명시로 독립하게 되었다.")

        elif number2==2:
            print("현재 맛집 목록==>")
            print(food.keys())
            query = input("어떤 음식의 맛집을 찾고 싶으신가요?:->")
            information = food.get(query)
            print("--------------------\n{}맛집은 {}.\n--------------------".format(query,information))

        elif number2==3:
            print("현재 놀거리  목록==>")
            print(play.keys())
            query = input("무슨 놀거리를 원하십니까?:->")
            information = play.get(query)
            print("--------------------\n{}을 즐길 장소는 {}.\n--------------------".format(query,information))

        elif number2==4:
            print("현재 관공서  목록==>")
            print(public.keys())
            query = input("어떤 관공서를 찾기를 원하십니까?:->")
            information = public.get(query)
            print("--------------------\n{} {}.\n--------------------".format(query,information))
            

        elif number2==5:
            print("광명시의 관광지를 소개하겠습니다.\n")
            print("충현 박물관 : 충현 박물관은 이원익 종가에서 만든 전국 유일의 종가박물관입니다. 조선시대의 선비문화를 계승, 보호 한다는 의미를 갖고 있습니다. ")
            print("개관 시간은 오전 10시 ~ 오후 5시로 관람요금은 성인 만원, 청소년 5천원 입니다.")
            print("")
            print("광명동굴 : 광명동굴은 1912년 일제가 자원 수탈을 목적으로 개발을 시작한 폐꽝입니다. 이 폐광을 새우젓 창고로 쓰다가 문화 관광명소로 탈바꿈 하였습니다")
            print("대한 민국 최고의 동굴테마파크, 수도권에서 보기 드문 동굴입니다.")
            print("여름에 가면 시원한 온도 때문에 시원한 여름을 지낼수 있습니다.")
            print("관람비는 성인 6천원, 청소년 3500원, 어린이 2천원입니다.")
            print("")
            print("안터 생태공원 : 안터생태공원은 경기도 중요 내륙습지 이며 환경부 법정 보호종이자 멸종위기 종 2급인 금개구리의 서식지를 보전하기 위해 만들어지 도시속 작은 생태계입니다.")
            print("금개구를 포함, 양서류, 파충류등 다양한 동식물이 서식하고 있는 내륙습지 입니다. 입장료는 무료입니다.")
            
            
    else :
        print("프로그램을 종료합니다. 즐거운 하루 보내세요*^^*")
        break
        
